<script>
	import CollapsibleTextComponent from '../components/CollapsibleTextComponent.svelte';
	import SectionComponent from '../components/SectionComponent.svelte';

	const manifest = `МАНІФЕСТ АНТИАГРЕСІЇ

Ми — ті, хто відчуває.
Ми — ті, хто не може більше мовчати.
Ми — ті, хто обирає бути людьми.

Агресія отруїла наше повітря.
Вона — у словах, що принижують.
У поглядах, що знецінюють.
У законах, що виключають.
У примусі, у мовчанні, в байдужості.
У хейті, насмішках, цькуванні.
У приниженні тіла й гідності.
У примушуванні підкорятись.
У насильстві.
У війнах.
У вбивствах.

Ми говоримо "ні" будь-якій агресії, спрямованій проти людини.
Людина не має права знищувати, принижувати, контролювати чи калічити іншу людину.

Ми визнаємо: агресія є всередині кожного, і це природно. Але ми обираємо інший шлях — проживати й трансформувати її так, щоб вона не шкодила іншій людині.

Ми створюємо простір, де можна бути собою — справжнім, вразливим, живим.

Ми говоримо "так" культурі дії без насильства.
Культурі взаємності.
Культурі збереження людини.

І перший наш крок — ПРИЙНЯТИ ЛЮДИНУ В СОБІ.
Другий — ПРИЙНЯТИ ЛЮДИНУ В ІНШОМУ.

Це — не слова. Це — вибір. Це — маніфест. Це — початок.

Ми — рух антиагресії.`;
</script>

<SectionComponent title="МАНІФЕСТ АНТИАГРЕСІЇ">
	{#snippet children()}
		<CollapsibleTextComponent
			lines={5}
			expandLabel="Показати більше"
			collapseLabel="Показати менше"
		>
			{#snippet children()}
				<p class="text-md whitespace-pre-line lg:text-lg">{manifest}</p>
			{/snippet}
		</CollapsibleTextComponent>
	{/snippet}
</SectionComponent>
